example/example.dot
digraph AuthMachine {
  NotLogged [ label="NotLogged()"]
  Login [ label="Login()\naction: doLogin()"]
  NotLogged -> Login [label="Login(String login, String password)"]
  Logged [ label="Logged(User user, bool isNew)"]
  Login -> Logged [label="Success(User user, bool isNew)"]
  Failure [ label="Failure(Object error)"]
  Login -> Failure [label="Failure(Object error)"]
  Register [ label="Register()\naction: doRegister()"]
  NotLogged -> Register [label="Register(String login, String password)"]
  Register -> Logged [label="Success(User user, bool isNew)"]
  Register -> Failure [label="Failure(Object error)"]
  Logout [ label="Logout()\naction: doLogout()"]
  Logged -> Logout [label="Logout(User? user)"]
  Logout -> NotLogged [label="LoggedOut()"]
  Failure -> NotLogged [label="Retry()"]
  Terminated [ label="Terminated()"]
  Failure -> Terminated [label="Exit()"]
  Logged -> Terminated [label="Exit()"]
  NotLogged -> Terminated [label="Exit()"]
  Login -> NotLogged [label="Cancel()"]
  Register -> NotLogged [label="Cancel()"]
  Logout -> NotLogged [label="Cancel()"]
}
